# FormulaManager Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormulaManager Class
Members See Also
---
A class to access and query information about formula engine in Revit models.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class FormulaManager : IDisposable
```

Visual Basic
---
```text
Public Class FormulaManager _
	Implements IDisposable
```

Visual C++
---
```text
public ref class FormulaManager : IDisposable
```

# Remarks
Formula manager
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FormulaManager
# See Also
FormulaManager Members
Autodesk.Revit.DB Namespace